       IDENTIFICATION DIVISION.
       PROGRAM-ID. PIZZAORDER.

      ******************************************************************
      * This program is a COBOL implementation of the pizza ordering   *
      * program suggested by Samuel Fare in his Medium post about      *
      * learning programming languages.                                *
      * https://medium.com/@samuel.fare/want-to-learn-any-programming- *
      * language-write-these-3-simple-apps-5af8cd119921                *
      ******************************************************************

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.


       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.

       9000-END-PROGRAM.
           STOP RUN.

       END PROGRAM PIZZAORDER.
